{
    "navbar": {
        "about-me": "About me",
        "my-projects": "My projects",
        "my-expericences": "My experiences",
        "contact-me": "Contact me"
    },
    "about-me": {
        "hello": "Hi, I'm Mathieu",
        "description": "Interdum et malesuada fames ac ante ipsum primis in faucibus. Vestibulum sodales sodales sem. Vivamus rhoncus magna lorem, sodales varius risus tincidunt non. Curabitur consectetur, libero non rutrum rhoncus, leo ipsum varius nisi, ac volutpat dui lorem non neque. Pellentesque efficitur, diam ut pharetra pulvinar, dolor turpis pretium erat, quis aliquam quam justo vel turpis. Duis finibus, erat eu consequat condimentum, magna libero accumsan nisl, ut tristique velit nibh eu nibh."
    },
    "my-projects": {
        "my-personals-projects": "My personals projects",
        "more-infos": "More infos",

        "projects-infos": {
            "realprice-imageAlt": "Advertisement for the RealPrice currency conversion app on Android, with the slogan 'your travel companion'.",
            "realprice-title": "Realprice - conversion app",
            "realprice-description": "With RealPrice, you can compare exchange rates between two currencies and adjust the commission percentage charged by your bank during international transactions. The app fetches exchange rates in real time thanks to an API.",

            "eula-bot-imageAlt": "Eula Bot banner with Discord/python logo and illustration of the character Eula on a starry background.",
            "eula-bot-title": "Eula-Bot - Chatbot discord",
            "eula-bot-description": "Eula-bot is a Discord chatbot developed in Python using the discord.py library. It offers various features such as moderation tools, fun and games commands, and utility functions to enhance the user experience on Discord servers.",

            "fastype-imageAlt": "Stylized logo with Fastype written on it",
            "fastype-title": "Fastype - a website to train your typing",
            "fastype-description": "Fastype is a game where you type words as fast as possible. Different game modes are available; the most popular one is “Fastaily.” This is a mode with a daily ranking where each player is given the same word list and has only one attempt per day to achieve a score. Users can create an account to track their stats and climb the leaderboard."
        }
    },
    "my-experiences": {
        "my-experiences": "My experiences",

        "bpce-3il-dates": "2024 - 2027",
        "bpce-3il-title": "3il ingénieurs - BPCE infogérance et technologies",
        "bpce-3il-description": "Interdum et malesuada fames ac ante ipsum primis in faucibus. Vestibulum sodales sodales sem. Vivamus rhoncus magna lorem, sodales varius risus tincidunt non. Interdum et malesuada fames ac ante ipsum primis in faucibus. Vestibulum sodales sodales sem. Vivamus rhoncus magna lorem, sodales varius risus tincidunt non. Interdum et malesuada fames ac ante ipsum primis in faucibus. Vestibulum sodales sodales sem."
    },
    "technical-skills": {
        "technical-skills": "Technical skills",
        "web": "Web",
        "databases": "Databases",
        "other-languages": "Other languages",
        "tools": "Tools",
        "infrastructure": "Infrastructure"
    },
    "contact-me": {
        "contact-me": "Contact me",
        "my-socials": "My socials",
        "email-me": "Email me",
        "check-github": "Check my Github",

        "send-me-a-message": "Send me a message",
        "your-name": "Your name",
        "name-placeholder": "Enter your name",
        "your-email": "Your email",
        "email-placeholder": "Enter your email",
        "your-message": "Your message",
        "message-placeholder": "Enter your message",
        "send-message": "Send message",
        "message-sent": "Message sent !"
    },
    "buttons": {
        "play-store": "play store",
        "site": "site",
        "close": "close"
    },
    "others": {
        "x-logo": "{ name }'s logo"
    },
    "errors": {
        "something-went-wrong": "Something went wrong :( please try again later",
        "invalid-email": "Invalid email address",
        "empty": "The field cannot be empty",
        "too-long": "The message is too long (max {max} characters)"
    }
}